In [3]:
import numpy as np
import pandas as pd

In [4]:
# Data-Frame -> A 2D labled data structure with columns of potentially different types
# Creating a dataFrame using pandas
data = pd.DataFrame(np.arange(0,30).reshape(5,6),index=["Row1","Row2","Row3","Row4","Row5"],columns=["C1","C2","C3","C4","C5","C6"])

In [5]:
data

      C1  C2  C3  C4  C5  C6
Row1   0   1   2   3   4   5
Row2   6   7   8   9  10  11
Row3  12  13  14  15  16  17
Row4  18  19  20  21  22  23
Row5  24  25  26  27  28  29

In [6]:
# Accessing the elements
# 1. .loc  2. .iloc 3. Direct column access
data.loc['Row3']

C1    12
C2    13
C3    14
C4    15
C5    16
C6    17
Name: Row3, dtype: int32

In [7]:
type(data.loc['Row3'])

pandas.core.series.Series

In [8]:
data[['C1','C3']]

      C1  C3
Row1   0   2
Row2   6   8
Row3  12  14
Row4  18  20
Row5  24  26

In [9]:
data.iloc[0:2,0:3]

      C1  C2  C3
Row1   0   1   2
Row2   6   7   8

In [11]:
# converting DataFrames into arrays
data.iloc[:,1:].values

array([[ 1,  2,  3,  4,  5],
       [ 7,  8,  9, 10, 11],
       [13, 14, 15, 16, 17],
       [19, 20, 21, 22, 23],
       [25, 26, 27, 28, 29]])

In [12]:
data.iloc[:,1:].values.shape

(5, 5)

In [16]:
#checking data frames whether it has a null value
data.isnull()

         C1     C2     C3     C4     C5     C6
Row1  False  False  False  False  False  False
Row2  False  False  False  False  False  False
Row3  False  False  False  False  False  False
Row4  False  False  False  False  False  False
Row5  False  False  False  False  False  False

In [17]:
data.sum()

C1    60
C2    65
C3    70
C4    75
C5    80
C6    85
dtype: int64

In [18]:
# Counting number of occurences of an element in the column
data["C3"].value_counts()

C3
2     1
8     1
14    1
20    1
26    1
Name: count, dtype: int64

In [19]:
# Finding unique elements in a column
data["C4"].unique()

array([ 3,  9, 15, 21, 27])

In [21]:
#Data Frame info
data.info()

<class 'pandas.core.frame.DataFrame'>
Index: 5 entries, Row1 to Row5
Data columns (total 6 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   C1      5 non-null      int32
 1   C2      5 non-null      int32
 2   C3      5 non-null      int32
 3   C4      5 non-null      int32
 4   C5      5 non-null      int32
 5   C6      5 non-null      int32
dtypes: int32(6)
memory usage: 332.0+ bytes

In [22]:
data.describe()

              C1         C2         C3         C4         C5         C6
count   5.000000   5.000000   5.000000   5.000000   5.000000   5.000000
mean   12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
std     9.486833   9.486833   9.486833   9.486833   9.486833   9.486833
min     0.000000   1.000000   2.000000   3.000000   4.000000   5.000000
25%     6.000000   7.000000   8.000000   9.000000  10.000000  11.000000
50%    12.000000  13.000000  14.000000  15.000000  16.000000  17.000000
75%    18.000000  19.000000  20.000000  21.000000  22.000000  23.000000
max    24.000000  25.000000  26.000000  27.000000  28.000000  29.000000